export const categoryColors: Record<number, string> = {
  1: '#F87171', // رۆمان
  2: '#60A5FA', // ئايين
  3: '#34D399', // فەلسەفە
  4: '#FBBF24', // مێژوو
  5: '#A78BFA', // گەشەپێدان
  6: '#F472B6', // ئابووري
  7: '#10B981', // ديوان
  8: '#FB923C', // ئەدەب
  9: '#60D394', // قورئان
  10: '#818CF8', // تەفسیر
  11: '#FACC15', // پەروەردە
  12: '#E879F9', // دەرون ناسی
  13: '#F97316', // منداڵان
  14: '#4ADE80', // جوگرافیا
  15: '#C084FC', // یاسا
  16: '#2DD4BF', // پزیشکی
  19: '#F43F5E', // بیرەوەری
  20: '#0EA5E9', // ئینگلیزی
  21: '#8B5CF6', // عیرفانی
  22: '#F59E0B', // بازارکاری
  24: '#A3E635', // هۆنراوە
  25: '#67E8F9', // کۆمەڵناسی
  26: '#EAB308', // زمانەوانی
  27: '#D946EF', // فەرهەنگ
  28: '#FCD34D', // چاوپێکەوتن
  29: '#4C1D95', // فکری
  30: '#7DD3FC', // لێکۆڵینەوە
  31: '#14B8A6', // دیوان
  32: '#A855F7', // توێژینەوە
  33: '#F87171', // وتار
  34: '#38BDF8', // فیزیا
  35: '#22D3EE', // کیمیا
  36: '#6366F1', // سینەمایی
  37: '#F472B6', // داستان و شانۆ
  39: '#16A34A', // ووتە
  40: '#EF4444', // سیاسی
  41: '#3B82F6', // وەرزش
  42: '#D97706', // کارگێری
  43: '#10B981', // زانستی
};

export const DEFAULT_CATEGORY_COLOR = '#D1D5DB';
